Tekla.Structures.ModelInternal.RebarPropertyStrip
The rebar property strip.

Tekla.Structures.ModelInternal.RebarPropertyStrip.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarPropertyStrip class.

Tekla.Structures.ModelInternal.RebarPropertyStrip.CloneStrip
Clones the property strip.
Returns: The cloned property strip.

Tekla.Structures.ModelInternal.RebarPropertyStrip.CreateInstance
The create instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarPropertyStrip.ModifyInstance
The modify instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarPropertyStrip.SelectInstance
The select instance.
Returns: The System.Boolean.

Tekla.Structures.ModelInternal.RebarPropertyStrip.ToStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The to struct.
dotStrip: The dot strip.

Tekla.Structures.ModelInternal.RebarPropertyStrip.FromStruct(Tekla.Structures.ModelInternal.dotRebarPropertyStrip_t@)
The from struct.
dotStrip: The dot strip.

Tekla.Structures.ModelInternal.RebarPropertyStrip.RebarProperties
Gets the rebar properties.